; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-1-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-7 - location
	p1-2 - location
	p3-2 - location
	p3-4 - location
	p4-1 - location
	p5-0 - location
	p5-1 - location
	p5-2 - location
	p5-4 - location
	p6-1 - location
	p6-2 - location
	p6-3 - location
	p6-5 - location
	p7-1 - location
	p7-4 - location
	)
	(:init
	(at driver1 s3)
	(at truck1 s7)
	(empty truck1)
	(at package1 s5)
	(at package2 s2)
	(at package3 s2)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s7)
	(link s7 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s3)
	(link s3 s6)
	(link s6 s4)
	(link s4 s6)
	(link s7 s5)
	(link s5 s7)
)
	(:goal (and
	(at driver1 s4)
	(at truck1 s5)
	(at package1 s7)
	(at package2 s3)
	(at package3 s2)
	))


)

; plan
1. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   goals met: 1 of 5
2. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   goals met: 2 of 5
3. (walk driver1 s4 p7-4)
   deleted: (at driver1 s4)
   added: (at driver1 p7-4)
   goals met: 1 of 5
4. (walk driver1 p7-4 s7)
   deleted: (at driver1 p7-4)
   added: (at driver1 s7)
   goals met: 1 of 5
5. (board-truck driver1 truck1 s7)
   deleted: (at driver1 s7) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 5
6. (drive-truck truck1 s7 s5 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 2 of 5
7. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 2 of 5
8. (drive-truck truck1 s5 s2 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 1 of 5
9. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 1 of 5
10. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 1 of 5
11. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 2 of 5
12. (drive-truck truck1 s3 s7 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   goals met: 2 of 5
13. (unload-truck package1 truck1 s7)
   deleted: (in package1 truck1)
   added: (at package1 s7)
   goals met: 3 of 5
14. (drive-truck truck1 s7 s5 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 4 of 5
15. (disembark-truck driver1 truck1 s5)
   deleted: (driving driver1 truck1)
   added: (at driver1 s5) (empty truck1)
   goals met: 4 of 5
16. (walk driver1 s5 p5-4)
   deleted: (at driver1 s5)
   added: (at driver1 p5-4)
   goals met: 4 of 5
17. (walk driver1 p5-4 s4)
   deleted: (at driver1 p5-4)
   added: (at driver1 s4)
   goals met: 5 of 5
